app/Models/CargosModel.php

    public function obtenerCargos()
    {
        $this->select('cargos.*,');
        $data = $this->findAll();
---
SELECT `cargos`.*
FROM `cargos`