app/Models/RolesModel.php

    public function obtenerRoles()
    {
        $this->select('roles.*,');
        $data = $this->findAll();
---
SELECT `roles`.*
FROM `roles`